[
	{
		"dates": "February 2019 · October 2025",
		"role": "Senior iOS Engineer",
		"company": "Memrise",
		"description": "Contributed to Memrise with a strong product mindset and a genuine belief in its mission to teach languages and enrich the world. Helped the iOS team adapt during restructuring by improving workflows and making pragmatic decisions about adopting cross-platform libraries. Introduced SwiftUI, Swift Package Manager, and AI-driven automation to make development faster.",
		"logo": "/assets/images/experiences/memrise.ico"
	},
	{
		"dates": "May 2017 · January 2019",
		"role": "Senior iOS Engineer",
		"company": "Moonpig",
		"description": "Led app modernization through clean architecture, TDD, and automation. Redefined workflows after team downsizing, delivering a one-click release pipeline and features like multi-item baskets and reminders to boost retention.",
		"logo": "/assets/images/experiences/moonpig_appstore_icon.png"
	},
	{
		"dates": "January 2015 · May 2017",
		"role": "iOS Engineer",
		"company": "MusicQubed / MTV Trax",
		"description": "Developed and maintained MTV Trax, a music streaming application. Introduced A/B testing, improved the app architecture, and later became the lead iOS developer.",
		"logo": "/assets/images/experiences/mtv_trax_appstore_icon.png"
	},
	{
		"dates": "June 2012 · April 2014",
		"role": "iOS Engineer",
		"company": "Droiders",
		"description": "Started as an intern and grew into a full-time iOS engineer. Built Enjoystr, a real-time messaging app using the XMPP protocol, and improved Dovespot, a social network application.",
		"logo": "/assets/images/experiences/droiders_appstore_icon.png"
	},
	{
		"dates": "June 2011 · May 2012",
		"role": "Software Engineer",
		"company": "Inforges",
		"description": "I began as an intern researching ePages, a CMS for eCommerce recently acquired by the company, and was later hired as the lead developer for ePages projects.",
		"logo": "/assets/images/experiences/inforges_icon.png"
	}
]
